tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "wix/brew"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Core application library for C
brew "glib"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# C++ interface to glib
brew "glibmm@2.66"
# Official C++ interface for the ATK accessibility toolkit library
brew "atkmm@2.28"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# YAML Parser
brew "libyaml"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Command-line automation tool
brew "bitrise"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Command-line tool to manipulate Android App Bundles
brew "bundletool"
# Vector graphics library with cross-device output support
brew "cairomm@1.14"
# Statistics utility to count lines of code
brew "cloc"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Isolated development environments using Docker
brew "docker-compose"
# Asynchronous event library
brew "libevent"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Spellchecker wrapping library
brew "enchant"
# Easiest way to build and release mobile apps
brew "fastlane"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU triangulated surface library
brew "gts"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Flexible API to implement spellchecking in GTK+ applications
brew "gspell"
# GUI toolkit
brew "gtk+"
# C++ interface to Pango
brew "pangomm@2.46"
# C++ interfaces for GTK+ and GNOME
brew "gtkmm3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool for managing JavaScript projects with multiple packages
brew "lerna"
# Terminal file manager
brew "lf"
# C++ wrapper for libxml
brew "libxml++"
# Bare libuv bindings for lua
brew "luv"
# Utility for directing compilation
brew "make"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@17"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Source-code syntax highlighter
brew "source-highlight"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Compiler for the GObject type system
brew "vala"
# Terminal emulator widget used by GNOME terminal
brew "vte3"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Apple simulator utilities
brew "wix/brew/applesimutils"
# Tools for building Android applications
cask "android-studio"
# Desktop debugging platform for mobile developers
cask "flipper"
# Web browser
cask "google-chrome-canary"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# VPN client for secure internet access and private browsing
cask "windscribe"
# Video communication and virtual meeting platform
cask "zoom"
# OpenJDK distribution from Azul
cask "zulu11"
# OpenJDK distribution from Azul
cask "zulu13"
# OpenJDK distribution from Azul
cask "zulu8"
vscode "aaron-bond.better-comments"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dannyconnell.split-html-attributes"
vscode "dbaeumer.vscode-eslint"
vscode "DotJoshJohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "gpem.4-colours"
vscode "HarryHopkinson.vim-theme"
vscode "mathiasfrohlich.Kotlin"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikaelkristiansson87.react-theme-vscode"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode.cpptools"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "naco-siren.gradle-language"
vscode "Nixon.env-cmd-file-syntax"
vscode "oderwat.indent-rainbow"
vscode "paragdiwan.gitpatch"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "uloco.theme-bluloco-light"
vscode "vincaslt.highlight-matching-tag"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "wesbos.theme-cobalt2"
vscode "wix.vscode-import-cost"
vscode "zhuangtongfa.material-theme"
