tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "wix/brew"
brew "adr-tools"
brew "glib"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "jpeg-xl"
brew "aom"
brew "at-spi2-core"
brew "glibmm@2.66"
brew "atkmm@2.28"
brew "libyaml"
brew "readline"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "bitrise"
brew "bottom"
brew "bundletool"
brew "cairomm@1.14"
brew "cloc"
brew "ruby"
brew "cocoapods"
brew "gmp"
brew "coreutils"
brew "libevent"
brew "folly"
brew "edencommon"
brew "enchant"
brew "fastlane"
brew "fizz"
brew "wangle"
brew "fb303"
brew "fbthrift"
brew "fd"
brew "libavif"
brew "gd"
brew "gh"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "gradle"
brew "gts"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gspell"
brew "gtk+"
brew "pangomm@2.46"
brew "gtkmm3"
brew "jq"
brew "lf"
brew "libxml++"
brew "make"
brew "mysql"
brew "neovim"
brew "nvm"
brew "openjdk@17"
brew "openssl@1.1"
brew "python@3.10"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "source-highlight"
brew "tldr"
brew "tmux"
brew "tpm"
brew "vala"
brew "vte3"
brew "watchman"
brew "yarn"
brew "wix/brew/applesimutils"
cask "android-studio"
cask "flipper"
cask "iterm2"
cask "react-native-debugger"
cask "telegram"
cask "visual-studio-code"
cask "windscribe"
cask "zoom"
cask "zulu11"
cask "zulu13"
cask "zulu17"
cask "zulu8"
