tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "wix/brew"
brew "adr-tools"
brew "glib"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "jpeg-xl"
brew "aom"
brew "at-spi2-core"
brew "glibmm@2.66"
brew "atkmm@2.28"
brew "readline"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "bitrise"
brew "bottom"
brew "bundletool"
brew "cairomm@1.14"
brew "libyaml"
brew "cloc"
brew "ruby"
brew "cocoapods"
brew "gmp"
brew "coreutils"
brew "libevent"
brew "folly"
brew "edencommon"
brew "enchant"
brew "fastlane"
brew "fizz"
brew "wangle"
brew "fb303"
brew "fbthrift"
brew "fd"
brew "libavif"
brew "gd"
brew "gh"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "gradle"
brew "gts"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gspell"
brew "gtk+"
brew "pangomm@2.46"
brew "gtkmm3"
brew "jq"
brew "lf"
brew "libxml++"
brew "make"
brew "mysql"
brew "neovim"
brew "nvm"
brew "openjdk@17"
brew "openssl@1.1"
brew "python@3.10"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "source-highlight"
brew "tldr"
brew "tmux"
brew "tpm"
brew "vala"
brew "vte3"
brew "watchman"
brew "yarn"
brew "wix/brew/applesimutils"
cask "android-studio"
cask "flipper"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "iterm2"
cask "kitty"
cask "phoenix"
cask "react-native-debugger"
cask "telegram"
cask "visual-studio-code"
cask "windscribe"
cask "zed"
cask "zoom"
cask "zulu11"
cask "zulu13"
cask "zulu17"
cask "zulu8"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codingtutorial.google-dark-plus"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.github-vscode-theme"
vscode "gpem.4-colours"
vscode "harryhopkinson.vim-theme"
vscode "mathiasfrohlich.kotlin"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikaelkristiansson87.react-theme-vscode"
vscode "ms-vscode.cpptools"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "naco-siren.gradle-language"
vscode "nixon.env-cmd-file-syntax"
vscode "oderwat.indent-rainbow"
vscode "paragdiwan.gitpatch"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "uloco.theme-bluloco-light"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscodevim.vim"
vscode "wesbos.theme-cobalt2"
vscode "wix.vscode-import-cost"
vscode "zhuangtongfa.material-theme"
